<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=95906ca2c7815c71ef36bbb78053c5b2a813bd5a]
data.aws_acm_certificate.namabanana: Reading...
data.aws_acm_certificate.namabanana: Read complete after 1s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
data.aws_iam_role.func1_role: Reading...
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
data.aws_iam_role.func1_role: Read complete after 0s [id=LambdaSESMailRole]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::note-app-static-pages",
              + "arn:aws:s3:::note-app-static-pages/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.note_app_cfront will be updated in-place
  ~ resource "aws_cloudfront_distribution" "note_app_cfront" {
      ~ aliases                         = [
          + "www.namabanana.com",
        ]
        id                              = "E35CO338AZ8MF7"
        tags                            = {}
        # (21 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = "arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9"
          ~ cloudfront_default_certificate = true -> false
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.func1 will be created
  + resource "aws_lambda_function" "func1" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "send-mail-ses"
      + handler                        = "src.app.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::958933161565:role/LambdaSESMailRole"
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "send-mail-ses.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "0/ERHEicaoTn6SVryY0Z7rOi+ZedvkfmLfsQsv2OV9c="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_s3_bucket.send_mail_ses_src will be created
  + resource "aws_s3_bucket" "send_mail_ses_src" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "send-mail-ses-src"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "send-mail-ses-src"
        }
      + tags_all                    = {
          + "Name" = "send-mail-ses-src"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.static_website will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_website" {
        id     = "note-app-static-pages"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::note-app-static-pages/*",
                          - "arn:aws:s3:::note-app-static-pages",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_object.func1 will be created
  + resource "aws_s3_object" "func1" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "send-mail-ses.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../backend/api/send-mail-ses/src.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
